burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_adc.h
/*!
    \file    gd32m53x_adc.h
    \brief   definitions for the ADC

    \version 2026-03-04, V1.0.0, firmware for GD32M53x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32M53X_ADC_H
#define GD32M53X_ADC_H

#include "gd32m53x.h"

/* ADC definitions */
#define ADC0                                ADC_BASE                                        /*!< ADC0 base address */
#define ADC2                                (ADC_BASE + 0x00000400U)                        /*!< ADC2 base address */

/* registers definitions */
#define ADC_EOCCTL(adcx)                    REG32((adcx) + 0x00000000U)                     /*!< software EOC control register */
#define ADC_CTL0(adcx)                      REG32((adcx) + 0x00000004U)                     /*!< control register 0 */
#define ADC_GPCGF0(adcx)                    REG32((adcx) + 0x00000008U)                     /*!< group config register 0 */
#define ADC_GPCGF1(adcx)                    REG32((adcx) + 0x0000000CU)                     /*!< group config register 1 */
#define ADC_CHSEL0(adcx)                    REG32((adcx) + 0x00000010U)                     /*!< channel selection register 0 */
#define ADC_CHSEL1(adcx)                    REG32((adcx) + 0x00000014U)                     /*!< channel selection register 1 */
#define ADC_SAMPR0(adcx)                    REG32((adcx) + 0x00000020U)                     /*!< sample time register 0 */
#define ADC_SAMPR1(adcx)                    REG32((adcx) + 0x00000024U)                     /*!< sample time register 1 */
#define ADC_SAMPR2(adcx)                    REG32((adcx) + 0x00000028U)                     /*!< sample time register 2, only for ADC2 */
#define ADC_CHPRI0(adcx)                    REG32((adcx) + 0x00000030U)                     /*!< channel priority register 0 */
#define ADC_CHPRI1(adcx)                    REG32((adcx) + 0x00000034U)                     /*!< channel priority register 1 */
#define ADC_ADDT0(adcx)                     REG32((adcx) + 0x00000040U)                     /*!< channel addition value config register 0 */
#define ADC_ADDT1(adcx)                     REG32((adcx) + 0x00000044U)                     /*!< channel addition value config register 1, only for ADC2 */
#define ADC_SDDATA(adcx)                    REG32((adcx) + 0x00000050U)                     /*!< self-diagnosis data register */
#define ADC_GP1BIDATA(adcx)                 REG32((adcx) + 0x00000060U)                     /*!< Group_pri1 bifurcate data register */
#define ADC_GP1BIDATA1(adcx)                REG32((adcx) + 0x00000064U)                     /*!< Group_pri1 bifurcate data register 1 */
#define ADC_GP1BIDATA2(adcx)                REG32((adcx) + 0x00000068U)                     /*!< Group_pri1 bifurcate data register 2 */
#define ADC_GP2BIDATA(adcx)                 REG32((adcx) + 0x0000006CU)                     /*!< Group_pri2 bifurcate data register */
#define ADC_GP2BIDATA1(adcx)                REG32((adcx) + 0x00000070U)                     /*!< Group_pri2 bifurcate data register 1 */
#define ADC_GP2BIDATA2(adcx)                REG32((adcx) + 0x00000074U)                     /*!< Group_pri2 bifurcate data register 2 */
#define ADC_GP3BIDATA(adcx)                 REG32((adcx) + 0x00000078U)                     /*!< Group_pri3 bifurcate data register */
#define ADC_GP3BIDATA1(adcx)                REG32((adcx) + 0x0000007CU)                     /*!< Group_pri3 bifurcate data register 1 */
#define ADC_GP3BIDATA2(adcx)                REG32((adcx) + 0x00000080U)                     /*!< Group_pri3 bifurcate data register 2 */
#define ADC_GP4BIDATA(adcx)                 REG32((adcx) + 0x00000084U)                     /*!< Group_pri4 bifurcate data register */
#define ADC_GP4BIDATA1(adcx)                REG32((adcx) + 0x00000088U)                     /*!< Group_pri4 bifurcate data register 1 */
#define ADC_GP4BIDATA2(adcx)                REG32((adcx) + 0x0000008CU)                     /*!< Group_pri4 bifurcate data register 2 */
#define ADC_GP1DMAR(adcx)                   REG32((adcx) + 0x00000090U)                     /*!< Group_pri1 data DMA register */
#define ADC_GP2DMAR(adcx)                   REG32((adcx) + 0x00000094U)                     /*!< Group_pri2 data DMA register */
#define ADC_GP3DMAR(adcx)                   REG32((adcx) + 0x00000098U)                     /*!< Group_pri3 data DMA register */
#define ADC_GP4DMAR(adcx)                   REG32((adcx) + 0x0000009CU)                     /*!< Group_pri4 data DMA register */
#define ADC_CH0DATA(adcx)                   REG32((adcx) + 0x000000A0U)                     /*!< channel 0 data register */
#define ADC_CH1DATA(adcx)                   REG32((adcx) + 0x000000A4U)                     /*!< channel 1 data register */
#define ADC_CH2DATA(adcx)                   REG32((adcx) + 0x000000A8U)                     /*!< channel 2 data register */
#define ADC_CH3DATA(adcx)                   REG32((adcx) + 0x000000ACU)                     /*!< channel 3 data register */
#define ADC_CH4DATA(adcx)                   REG32((adcx) + 0x000000B0U)                     /*!< channel 4 data register */
#define ADC_CH5DATA(adcx)                   REG32((adcx) + 0x000000B4U)                     /*!< channel 5 data register */
#define ADC_CH6DATA(adcx)                   REG32((adcx) + 0x000000B8U)                     /*!< channel 6 data register */
#define ADC_CH7DATA(adcx)                   REG32((adcx) + 0x000000BCU)                     /*!< channel 7 data register, only for ADC2 */
#define ADC_CH8DATA(adcx)                   REG32((adcx) + 0x000000C0U)                     /*!< channel 8 data register, only for ADC2 */
#define ADC_CH9DATA(adcx)                   REG32((adcx) + 0x000000C4U)                     /*!< channel 9 data register, only for ADC2 */
#define ADC_TEMPDATA(adcx)                  REG32((adcx) + 0x000000C8U)                     /*!< temperature sensor channel data register, only for ADC2 */
#define ADC_VINTDATA(adcx)                  REG32((adcx) + 0x000000CCU)                     /*!< internal reference voltage channel data register, only for ADC2 */
#define ADC_WDCTL(adcx)                     REG32((adcx) + 0x00000100U)                     /*!< watchdog control register */
#define ADC_WDATHOLD(adcx)                  REG32((adcx) + 0x00000104U)                     /*!< watchdog A threshold register */
#define ADC_WDBTHOLD(adcx)                  REG32((adcx) + 0x00000108U)                     /*!< watchdog B threshold register */
#define ADC_WDACHCFG(adcx)                  REG32((adcx) + 0x0000010CU)                      /*!< watchdog A channel config register */
#define ADC_WDACHSTAT(adcx)                 REG32((adcx) + 0x00000110U)                     /*!< watchdog A channel status register */
#define ADC_CTL1(adcx)                      REG32((adcx) + 0x00000150U)                     /*!< control register 1 */
#define ADC_SHCTL                           REG32((ADC0) + 0x00000160U)                     /*!< sample-and-hold control register */
#define ADC_DMACTL(adcx)                    REG32((adcx) + 0x00000170U)                     /*!< DMA control register */
#define ADC_BITRGCTL(adcx)                  REG32((adcx) + 0x00000180U)                     /*!< bifurcate trigger control register */

