burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_adc.h
/* bits definitions */
/* ADC_EOCCTL */
#define ADC_EOCCTL_EVICG1SEL                BIT(0)                                          /*!< EVIC trigger signal select from Group_pri1 */
#define ADC_EOCCTL_GP1SWST                  BIT(1)                                          /*!< software start conversion of Group_pri1 */
#define ADC_EOCCTL_EOC1RIE                  BIT(2)                                          /*!< interrupt enable for EOC1RF */
#define ADC_EOCCTL_EOC1F                    BIT(3)                                          /*!< end of Group_pri1 conversion flag */
#define ADC_EOCCTL_EOC1RF                   BIT(4)                                          /*!< end of Group_pri1 conversion round flag */
#define ADC_EOCCTL_EOC1RCNT                 BITS(5,7)                                       /*!< end of Group_pri1 conversion round counts */
#define ADC_EOCCTL_EVICG2SEL                BIT(8)                                          /*!< EVIC trigger signal select from Group_pri2 */
#define ADC_EOCCTL_GP2SWST                  BIT(9)                                          /*!< software start conversion of Group_pri2 */
#define ADC_EOCCTL_EOC2RIE                  BIT(10)                                         /*!< interrupt enable for EOC2RF */
#define ADC_EOCCTL_EOC2F                    BIT(11)                                         /*!< end of Group_pri2 conversion flag */
#define ADC_EOCCTL_EOC2RF                   BIT(12)                                         /*!< end of Group_pri2 conversion round flag */
#define ADC_EOCCTL_EOC2RCNT                 BITS(13,15)                                     /*!< end of Group_pri2 conversion round counts */
#define ADC_EOCCTL_EVICG3SEL                BIT(16)                                         /*!< EVIC trigger signal select from Group_pri3 */
#define ADC_EOCCTL_GP3SWST                  BIT(17)                                         /*!< software start conversion of Group_pri3 */
#define ADC_EOCCTL_EOC3RIE                  BIT(18)                                         /*!< interrupt enable for EOC3RF */
#define ADC_EOCCTL_EOC3F                    BIT(19)                                         /*!< end of Group_pri3 conversion flag */
#define ADC_EOCCTL_EOC3RF                   BIT(20)                                         /*!< end of Group_pri3 conversion round flag */
#define ADC_EOCCTL_EOC3RCNT                 BITS(21,23)                                     /*!< end of Group_pri3 conversion round counts */
#define ADC_EOCCTL_EVICG4SEL                BIT(24)                                         /*!< EVIC trigger signal select from Group_pri4 */
#define ADC_EOCCTL_GP4SWST                  BIT(25)                                         /*!< software start conversion of Group_pri4 */
#define ADC_EOCCTL_EOC4RIE                  BIT(26)                                         /*!< interrupt enable for EOC4RF */
#define ADC_EOCCTL_EOC4F                    BIT(27)                                         /*!< end of Group_pri4 conversion flag */
#define ADC_EOCCTL_EOC4RF                   BIT(28)                                         /*!< end of Group_pri4 conversion round flag */
#define ADC_EOCCTL_EOC4RCNT                 BITS(29,31)                                     /*!< end of Group_pri4 conversion round counts */

/* ADC_CTL0 */
#define ADC_CTL0_LPGCNT                     BIT(0)                                          /*!< enable lowest-priority group scan continuous */
#define ADC_CTL0_GPRIEN                     BIT(3)                                          /*!< enable group priority */
#define ADC_CTL0_CHRSEL                     BITS(4,8)                                       /*!< select precharge and discharge */
#define ADC_CTL0_CHRSEL_MODE                BIT(8)                                          /*!< A/D disconnection detection assist mode */
#define ADC_CTL0_CHRSEL_PERIOD              BITS(4,7)                                       /*!< A/D disconnection detection assist period */
#define ADC_CTL0_DAL                        BIT(9)                                          /*!< data storage alignment mode */
#define ADC_CTL0_SDSEN                      BIT(10)                                         /*!< enable self-diagnosis */
#define ADC_CTL0_SDSFIX                     BIT(11)                                         /*!< enable fix mode for self-diagnosis voltage */
#define ADC_CTL0_SDVOG                      BITS(12,13)                                     /*!< configure fix voltage for self-diagnosis conversion */
#define ADC_CTL0_ACDATA                     BIT(14)                                         /*!< enable automatic clearing data registers */
#define ADC_CTL0_ASDATA                     BIT(15)                                         /*!< enable automatic setting data registers */
#define ADC_CTL0_ADDEN                      BIT(16)                                         /*!< addition function enable */
#define ADC_CTL0_PROCF                      BIT(19)                                         /*!< A/D conversion process flag */
#define ADC_CTL0_GSCAN                      BITS(20,21)                                     /*!< group scan mode */
#define ADC_CTL0_ADDSEL                     BIT(22)                                         /*!< A/D conversion data addition mode selection */
#define ADC_CTL0_GP3EN                      BIT(23)                                         /*!< enable A/D conversion operation for Group_pri3 */
#define ADC_CTL0_GP4EN                      BIT(24)                                         /*!< enable A/D conversion operation for Group_pri4 */
#define ADC_CTL0_EVICCTL                    BITS(28,30)                                     /*!< EVIC link signal control */
#define ADC_CTL0_SWEND                      BIT(31)                                         /*!< software end conversion of Group_pri1/pri2/pri3/pri4 */

/* ADC_GPCGF0 */
#define ADC_GPCGF0_G1TRGEN                  BIT(0)                                          /*!< enable Group_pri1 synchronous or asynchronous trigger */
#define ADC_GPCGF0_GP1TRGTY                 BIT(1)                                          /*!< group_pri1 trigger type select */
#define ADC_GPCGF0_GP1TRGSRC                BITS(2,7)                                       /*!< synchronous trigger source for Group_pri1 */
#define ADC_GPCGF0_GP1TRGED                 BITS(8,9)                                       /*!< trigger edge select of Group_pri1 */
#define ADC_GPCGF0_G2TRGEN                  BIT(16)                                         /*!< enable Group_pri2 synchronous or asynchronous trigger */
#define ADC_GPCGF0_GP2TRGTY                 BIT(17)                                         /*!< Group_pri2 trigger type select */
#define ADC_GPCGF0_GP2TRGSRC                BITS(18,23)                                     /*!< synchronous trigger source for Group_pri2 */
#define ADC_GPCGF0_GP2TRGED                 BITS(24,25)                                     /*!< trigger edge select of Group_pri2 */
#define ADC_GPCGF0_GP2RTCH                  BIT(28)                                         /*!< Group_pri2 rescan channel select */
#define ADC_GPCGF0_GP2RTEN                  BIT(29)                                         /*!< enable Group_pri2 rescan */

