burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_adc.h
/* ADC_GPCGF1 */
#define ADC_GPCGF1_G3TRGEN                  BIT(0)                                          /*!< enable Group_pri3 synchronous or asynchronous trigger */
#define ADC_GPCGF1_GP3TRGTY                 BIT(1)                                          /*!< Group_pri3 trigger type select */
#define ADC_GPCGF1_GP3TRGSRC                BITS(2,7)                                       /*!< synchronous trigger source for Group_pri3 */
#define ADC_GPCGF1_GP3TRGED                 BITS(8,9)                                       /*!< trigger edge select of Group_pri3 */
#define ADC_GPCGF1_GP3RTCH                  BIT(12)                                         /*!< Group_pri3 rescan channel select */
#define ADC_GPCGF1_GP3RTEN                  BIT(13)                                         /*!< enable Group_pri3 rescan */
#define ADC_GPCGF1_G4TRGEN                  BIT(16)                                         /*!< enable Group_pri4 synchronous or asynchronous trigger */
#define ADC_GPCGF1_GP4TRGTY                 BIT(17)                                         /*!< Group_pri4 trigger type select */
#define ADC_GPCGF1_GP4TRGSRC                BITS(18,23)                                     /*!< synchronous trigger source for Group_pri4 */
#define ADC_GPCGF1_GP4TRGED                 BITS(24,25)                                     /*!< trigger edge select of Group_pri4 */
#define ADC_GPCGF1_GP4RTCH                  BIT(28)                                         /*!< Group_pri4 rescan channel select */
#define ADC_GPCGF1_GP4RTEN                  BIT(29)                                         /*!< enable Group_pri4 rescan */

/* ADC_CHSEL0 */
#define ADC_CHANNEL_GP1_ALL                 BITS(0,11)                                      /*!< All channel in Group_pri1 */
#define ADC_CHANNEL_GP2_ALL                 BITS(16,27)                                     /*!< All channel in Group_pri2 */
#define ADC_CHSEL0_GP1CH0                   BIT(0)                                          /*!< select channel ADCx_IN0 in Group_pri1 */
#define ADC_CHSEL0_GP1CH1                   BIT(1)                                          /*!< select channel ADCx_IN1 in Group_pri1 */
#define ADC_CHSEL0_GP1CH2                   BIT(2)                                          /*!< select channel ADCx_IN2 in Group_pri1 */
#define ADC_CHSEL0_GP1CH3                   BIT(3)                                          /*!< select channel ADCx_IN3 in Group_pri1 */
#define ADC_CHSEL0_GP1CH4                   BIT(4)                                          /*!< select channel ADCx_IN4 in Group_pri1 */
#define ADC_CHSEL0_GP1CH5                   BIT(5)                                          /*!< select channel ADCx_IN5 in Group_pri1 */
#define ADC_CHSEL0_GP1CH6                   BIT(6)                                          /*!< select channel ADCx_IN6 in Group_pri1 */
#define ADC_CHSEL0_GP1CH7                   BIT(7)                                          /*!< select channel ADCx_IN7 in Group_pri1 */
#define ADC_CHSEL0_GP1CH8                   BIT(8)                                          /*!< select channel ADCx_IN8 in Group_pri1 */
#define ADC_CHSEL0_GP1CH9                   BIT(9)                                          /*!< select channel ADCx_IN9 in Group_pri1 */
#define ADC_CHSEL0_GP1TEMP                  BIT(10)                                         /*!< select temperature sensor channel in Group_pri1 */
#define ADC_CHSEL0_GP1VINT                  BIT(11)                                         /*!< select internal reference voltage channel in Group_pri1 */
#define ADC_CHSEL0_GP2CH0                   BIT(16)                                         /*!< select channel ADCx_IN0 in Group_pri2 */
#define ADC_CHSEL0_GP2CH1                   BIT(17)                                         /*!< select channel ADCx_IN1 in Group_pri2 */
#define ADC_CHSEL0_GP2CH2                   BIT(18)                                         /*!< select channel ADCx_IN2 in Group_pri2 */
#define ADC_CHSEL0_GP2CH3                   BIT(19)                                         /*!< select channel ADCx_IN3 in Group_pri2 */
#define ADC_CHSEL0_GP2CH4                   BIT(20)                                         /*!< select channel ADCx_IN4 in Group_pri2 */
#define ADC_CHSEL0_GP2CH5                   BIT(21)                                         /*!< select channel ADCx_IN5 in Group_pri2 */
#define ADC_CHSEL0_GP2CH6                   BIT(22)                                         /*!< select channel ADCx_IN6 in Group_pri2 */
#define ADC_CHSEL0_GP2CH7                   BIT(23)                                         /*!< select channel ADCx_IN7 in Group_pri2 */
#define ADC_CHSEL0_GP2CH8                   BIT(24)                                         /*!< select channel ADCx_IN8 in Group_pri2 */
#define ADC_CHSEL0_GP2CH9                   BIT(25)                                         /*!< select channel ADCx_IN9 in Group_pri2 */
#define ADC_CHSEL0_GP2TEMP                  BIT(26)                                         /*!< select temperature sensor channel in Group_pri2 */
#define ADC_CHSEL0_GP2VINT                  BIT(27)                                         /*!< select internal reference voltage channel in Group_pri2 */

/* ADC_CHSEL1 */
#define ADC_CHANNEL_GP3_ALL                 BITS(0,11)                                      /*!< All channel in Group_pri3 */
#define ADC_CHANNEL_GP4_ALL                 BITS(16,27)                                     /*!< All channel in Group_pri4 */
#define ADC_CHSEL0_GP3CH0                   BIT(0)                                          /*!< select channel ADCx_IN0 in Group_pri3 */
#define ADC_CHSEL0_GP3CH1                   BIT(1)                                          /*!< select channel ADCx_IN1 in Group_pri3 */
#define ADC_CHSEL0_GP3CH2                   BIT(2)                                          /*!< select channel ADCx_IN2 in Group_pri3 */
#define ADC_CHSEL0_GP3CH3                   BIT(3)                                          /*!< select channel ADCx_IN3 in Group_pri3 */
#define ADC_CHSEL0_GP3CH4                   BIT(4)                                          /*!< select channel ADCx_IN4 in Group_pri3 */
#define ADC_CHSEL0_GP3CH5                   BIT(5)                                          /*!< select channel ADCx_IN5 in Group_pri3 */
#define ADC_CHSEL0_GP3CH6                   BIT(6)                                          /*!< select channel ADCx_IN6 in Group_pri3 */
#define ADC_CHSEL0_GP3CH7                   BIT(7)                                          /*!< select channel ADCx_IN7 in Group_pri3 */
#define ADC_CHSEL0_GP3CH8                   BIT(8)                                          /*!< select channel ADCx_IN8 in Group_pri3 */
#define ADC_CHSEL0_GP3CH9                   BIT(9)                                          /*!< select channel ADCx_IN9 in Group_pri3 */
#define ADC_CHSEL0_GP3TEMP                  BIT(10)                                         /*!< select temperature sensor channel in Group_pri3 */
#define ADC_CHSEL0_GP3VINT                  BIT(11)                                         /*!< select internal reference voltage channel in Group_pri3 */
#define ADC_CHSEL0_GP4CH0                   BIT(16)                                         /*!< select channel ADCx_IN0 in Group_pri4 */
#define ADC_CHSEL0_GP4CH1                   BIT(17)                                         /*!< select channel ADCx_IN1 in Group_pri4 */
#define ADC_CHSEL0_GP4CH2                   BIT(18)                                         /*!< select channel ADCx_IN2 in Group_pri4 */
#define ADC_CHSEL0_GP4CH3                   BIT(19)                                         /*!< select channel ADCx_IN3 in Group_pri4 */
#define ADC_CHSEL0_GP4CH4                   BIT(20)                                         /*!< select channel ADCx_IN4 in Group_pri4 */
#define ADC_CHSEL0_GP4CH5                   BIT(21)                                         /*!< select channel ADCx_IN5 in Group_pri4 */
#define ADC_CHSEL0_GP4CH6                   BIT(22)                                         /*!< select channel ADCx_IN6 in Group_pri4 */
#define ADC_CHSEL0_GP4CH7                   BIT(23)                                         /*!< select channel ADCx_IN7 in Group_pri4 */
#define ADC_CHSEL0_GP4CH8                   BIT(24)                                         /*!< select channel ADCx_IN8 in Group_pri4 */
#define ADC_CHSEL0_GP4CH9                   BIT(25)                                         /*!< select channel ADCx_IN9 in Group_pri4 */
#define ADC_CHSEL0_GP4TEMP                  BIT(26)                                         /*!< select temperature sensor channel in Group_pri4 */
#define ADC_CHSEL0_GP4VINT                  BIT(27)                                         /*!< select internal reference voltage channel in Group_pri4 */

/* ADC_SAMPR0 */
#define ADC_SAMPR0_SPT00                    BITS(0,7)                                       /*!< sample time config for channel ADCx_IN0 */
#define ADC_SAMPR0_SPT01                    BITS(8,15)                                      /*!< sample time config for channel ADCx_IN1 */
#define ADC_SAMPR0_SPT02                    BITS(16,23)                                     /*!< sample time config for channel ADCx_IN2 */
#define ADC_SAMPR0_SPT03                    BITS(24,31)                                     /*!< sample time config for channel ADCx_IN3 */

