burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_adc.h
/* ADC_SAMPR1 */
#define ADC_SAMPR1_SPT04                    BITS(0,7)                                       /*!< sample time config for channel ADCx_IN4 */
#define ADC_SAMPR1_SPT05                    BITS(8,15)                                      /*!< sample time config for channel ADCx_IN5 */
#define ADC_SAMPR1_SPT06                    BITS(16,23)                                     /*!< sample time config for channel ADCx_IN6 */
#define ADC_SAMPR1_SPT07                    BITS(24,31)                                     /*!< sample time config for channel ADCx_IN7 */

/* ADC_SAMPR2 */
#define ADC_SAMPR2_SPT08                    BITS(0,7)                                       /*!< sample time config for channel ADCx_IN8 */
#define ADC_SAMPR2_SPT09                    BITS(8,15)                                      /*!< sample time config for channel ADCx_IN9 */
#define ADC_SAMPR2_SPTTEMP                  BITS(16,23)                                     /*!< sample time config for the temperature sensor channel */
#define ADC_SAMPR2_SPTVINT                  BITS(24,31)                                     /*!< sample time config for the internal voltage channel */

/* ADC_CHPRI0 */
#define ADC_CHPRI0_PRI0                    BITS(0,3)                                       /*!< the 1th priority of the selected channel */
#define ADC_CHPRI0_PRI1                    BITS(4,7)                                       /*!< the 2th priority of the selected channel */
#define ADC_CHPRI0_PRI2                    BITS(8,11)                                      /*!< the 3th priority of the selected channel */
#define ADC_CHPRI0_PRI3                    BITS(12,15)                                     /*!< the 4th priority of the selected channel */
#define ADC_CHPRI0_PRI4                    BITS(16,19)                                     /*!< the 5th priority of the selected channel */
#define ADC_CHPRI0_PRI5                    BITS(20,23)                                     /*!< the 6th priority of the selected channel */
#define ADC_CHPRI0_PRI6                    BITS(24,27)                                     /*!< the 7th priority of the selected channel */
#define ADC_CHPRI0_PRI7                    BITS(28,31)                                     /*!< the 8th priority of the selected channel */

/* ADC_CHPRI1 */
#define ADC_CHPRI1_PRI8                    BITS(0,3)                                       /*!< the 9th priority of the selected channel */
#define ADC_CHPRI1_PRI9                    BITS(4,7)                                       /*!< the 10th priority of the selected channel */
#define ADC_CHPRI1_PRI10                   BITS(8,11)                                      /*!< the 11th priority of the selected channel */
#define ADC_CHPRI1_PRI11                   BITS(12,15)                                     /*!< the 12th priority of the selected channel */

/* ADC_ADDT0 */
#define ADC_ADDT0_CH0ADDT                   BITS(0,3)                                       /*!< the total addition conversion times of ADCx_IN0 */
#define ADC_ADDT0_CH1ADDT                   BITS(4,7)                                       /*!< the total addition conversion times of ADCx_IN1 */
#define ADC_ADDT0_CH2ADDT                   BITS(8,11)                                      /*!< the total addition conversion times of ADCx_IN2 */
#define ADC_ADDT0_CH3ADDT                   BITS(12,15)                                     /*!< the total addition conversion times of ADCx_IN3 */
#define ADC_ADDT0_CH4ADDT                   BITS(16,19)                                     /*!< the total addition conversion times of ADCx_IN4 */
#define ADC_ADDT0_CH5ADDT                   BITS(20,23)                                     /*!< the total addition conversion times of ADCx_IN5 */
#define ADC_ADDT0_CH6ADDT                   BITS(24,27)                                     /*!< the total addition conversion times of ADCx_IN6 */
#define ADC_ADDT0_CH7ADDT                   BITS(28,31)                                     /*!< the total addition conversion times of ADCx_IN7 */

/* ADC_ADDT1 */
#define ADC_ADDT1_CH8ADDT                   BITS(0,3)                                       /*!< the total addition conversion times of ADCx_IN8 */
#define ADC_ADDT1_CH9ADDT                   BITS(4,7)                                       /*!< the total addition conversion times of ADCx_IN9 */
#define ADC_ADDT1_TEMPADDT                  BITS(8,11)                                      /*!< the total addition conversion times of temperature sensor channel */
#define ADC_ADDT1_VINTADDT                  BITS(12,15)                                     /*!< the total addition conversion times of internal reference voltage channel */

/* ADC_SDDATA */
#define ADC_SDDATA_SDDATA_LSB               BITS(0,11)                                      /*!< LSB alignment (DAL=0): self-diagnosis channel data */
#define ADC_SDDATA_SDSTA_LSB                BITS(14,15)                                     /*!< LSB alignment (DAL=0): voltage status converted by self-diagnosis */
#define ADC_SDDATA_SDDATA_MSB               BITS(4,15)                                      /*!< MSB alignment (DAL=1): self-diagnosis channel data */
#define ADC_SDDATA_SDSTA_MSB                BITS(0,1)                                       /*!< MSB alignment (DAL=1): voltage status converted by self-diagnosis */

/* ADC_GPxBIDATA, x=1,2,3,4 */
#define ADC_GPXBIDATA_BIDATA                BITS(0,15)                                      /*!< the data by the second trigger in bifurcate trigger mode */

/* ADC_GPxBIDATA1, x=1,2,3,4 */
#define ADC_GPXBIDATA1_BIDATA1              BITS(0,15)                                      /*!< the data by the first trigger in extended bifurcate trigger mode */

/* ADC_GPxBIDATA2, x=1,2,3,4 */
#define ADC_GPXBIDATA2_BIDATA2              BITS(0,15)                                      /*!< the data by the second trigger in extended bifurcate trigger mode */

/* ADC_GPxDMAR, x=1,2,3,4 */
#define ADC_GPXDMAR_GDATA                   BITS(0,15)                                      /*!< the data of Group_prix which can be accessed by DMA */

