burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_adc.h
/* ADC_CHxDATA, for ADC0, x=0..6, for ADC2, x=0..9 */
#define ADC_CHXDATA_GDATA                   BITS(0,15)                                      /*!< channel x data */

/* ADC_VINTDATA */
#define ADC_VINTDATA_VINTDATA               BITS(0,15)                                      /*!< internal reference voltage channel data */

/* ADC_TEMPDATA */
#define ADC_TEMPDATA_TEMPDATA               BITS(0,15)                                      /*!< temperature sensor channel data */

/* ADC_WDCTL */
#define ADC_WDCTL_WDAEN                     BIT(0)                                          /*!< watchdog A enable */
#define ADC_WDCTL_WDAIE                     BIT(1)                                          /*!< interrupt enable for watchdog A */
#define ADC_WDCTL_WDBEN                     BIT(2)                                          /*!< watchdog B enable */
#define ADC_WDCTL_WDBIE                     BIT(3)                                          /*!< interrupt enable for watchdog B */
#define ADC_WDCTL_WDBCM                     BIT(4)                                          /*!< watchdog B compare conditions mode */
#define ADC_WDCTL_WINEN                     BIT(5)                                          /*!< window mode enable */
#define ADC_WDCTL_WDABCC                    BITS(6,7)                                       /*!< watchdog A/B complex conditions configuration */
#define ADC_WDCTL_WDBEF                     BIT(17)                                         /*!< analog watchdog B event flag */
#define ADC_WDCTL_WDAMF                     BIT(18)                                         /*!< analog watchdog A compare monitor flag */
#define ADC_WDCTL_WDBMF                     BIT(19)                                         /*!< analog watchdog B compare monitor flag */
#define ADC_WDCTL_WDABMF                    BIT(20)                                         /*!< analog watchdog A/B complex compare monitor flag */
#define ADC_WDCTL_WDBCHSEL                  BITS(28,31)                                     /*!< analog watchdog B channel select */

/* ADC_WDATHOLD*/
#define ADC_WDATHOLD_WDALT                  BITS(0,15)                                      /*!< low threshold for analog watchdog A */
#define ADC_WDATHOLD_WDAHT                  BITS(16,31)                                     /*!< high threshold for analog watchdog A */

/* ADC_WDBTHOLD*/
#define ADC_WDBTHOLD_WDBLT                  BITS(0,15)                                      /*!< low threshold for analog watchdog B */
#define ADC_WDBTHOLD_WDBHT                  BITS(16,31)                                     /*!< high threshold for analog watchdog B */

/* ADC_WDACHCFG */
#define ADC_WDACHCFG_WDACH0M                BIT(0)                                          /*!< channel ADCx_IN0 watchdog A compare conditions mode */
#define ADC_WDACHCFG_WDACH1M                BIT(1)                                          /*!< channel ADCx_IN1 watchdog A compare conditions mode */
#define ADC_WDACHCFG_WDACH2M                BIT(2)                                          /*!< channel ADCx_IN2 watchdog A compare conditions mode */
#define ADC_WDACHCFG_WDACH3M                BIT(3)                                          /*!< channel ADCx_IN3 watchdog A compare conditions mode */
#define ADC_WDACHCFG_WDACH4M                BIT(4)                                          /*!< channel ADCx_IN4 watchdog A compare conditions mode */
#define ADC_WDACHCFG_WDACH5M                BIT(5)                                          /*!< channel ADCx_IN5 watchdog A compare conditions mode */
#define ADC_WDACHCFG_WDACH6M                BIT(6)                                          /*!< channel ADCx_IN6 watchdog A compare conditions mode */
#define ADC_WDACHCFG_WDACH7M                BIT(7)                                          /*!< channel ADCx_IN7 watchdog A compare conditions mode */
#define ADC_WDACHCFG_WDACH8M                BIT(8)                                          /*!< channel ADCx_IN8 watchdog A compare conditions mode */
#define ADC_WDACHCFG_WDACH9M                BIT(9)                                          /*!< channel ADCx_IN9 watchdog A compare conditions mode */
#define ADC_WDACHCFG_WDATEMPM               BIT(10)                                         /*!< temperature sensor channel watchdog A compare conditions mode */
#define ADC_WDACHCFG_WDAVINTM               BIT(11)                                         /*!< internal reference voltage channel watchdog A compare conditions mode */
#define ADC_WDACHCFG_WDACH0                 BIT(16)                                         /*!< select ADCx_IN0 for watchdog A */
#define ADC_WDACHCFG_WDACH1                 BIT(17)                                         /*!< select ADCx_IN1 for watchdog A */
#define ADC_WDACHCFG_WDACH2                 BIT(18)                                         /*!< select ADCx_IN2 for watchdog A */
#define ADC_WDACHCFG_WDACH3                 BIT(19)                                         /*!< select ADCx_IN3 for watchdog A */
#define ADC_WDACHCFG_WDACH4                 BIT(20)                                         /*!< select ADCx_IN4 for watchdog A */
#define ADC_WDACHCFG_WDACH5                 BIT(21)                                         /*!< select ADCx_IN5 for watchdog A */
#define ADC_WDACHCFG_WDACH6                 BIT(22)                                         /*!< select ADCx_IN6 for watchdog A */
#define ADC_WDACHCFG_WDACH7                 BIT(23)                                         /*!< select ADCx_IN7 for watchdog A */
#define ADC_WDACHCFG_WDACH8                 BIT(24)                                         /*!< select ADCx_IN8 for watchdog A */
#define ADC_WDACHCFG_WDACH9                 BIT(25)                                         /*!< select ADCx_IN9 for watchdog A */
#define ADC_WDACHCFG_WDATEMP                BIT(26)                                         /*!< select temperature sensor channel for watchdog A */
#define ADC_WDACHCFG_WDAVINT                BIT(27)                                         /*!< select internal reference voltage channel for watchdog A */

/* ADC_WDACHSTAT*/
#define ADC_WDACHSTAT_CH0CMPF               BIT(0)                                          /*!< channel ADCx_IN0 compare status in watchdog A */
#define ADC_WDACHSTAT_CH1CMPF               BIT(1)                                          /*!< channel ADCx_IN1 compare status in watchdog A */
#define ADC_WDACHSTAT_CH2CMPF               BIT(2)                                          /*!< channel ADCx_IN2 compare status in watchdog A */
#define ADC_WDACHSTAT_CH3CMPF               BIT(3)                                          /*!< channel ADCx_IN3 compare status in watchdog A */
#define ADC_WDACHSTAT_CH4CMPF               BIT(4)                                          /*!< channel ADCx_IN4 compare status in watchdog A */
#define ADC_WDACHSTAT_CH5CMPF               BIT(5)                                          /*!< channel ADCx_IN5 compare status in watchdog A */
#define ADC_WDACHSTAT_CH6CMPF               BIT(6)                                          /*!< channel ADCx_IN6 compare status in watchdog A */
#define ADC_WDACHSTAT_CH7CMPF               BIT(7)                                          /*!< channel ADCx_IN7 compare status in watchdog A */
#define ADC_WDACHSTAT_CH8CMPF               BIT(8)                                          /*!< channel ADCx_IN8 compare status in watchdog A */
#define ADC_WDACHSTAT_CH9CMPF               BIT(9)                                          /*!< channel ADCx_IN9 compare status in watchdog A */
#define ADC_WDACHSTAT_TEMPCMPF              BIT(10)                                         /*!< temperature sensor channel compare status in watchdog A */
#define ADC_WDACHSTAT_VINTCMPF              BIT(11)                                         /*!< internal reference voltage channel compare status in watchdog A */

/* ADC_CTL1 */
#define ADC_CTL1_ADCON                      BIT(13)                                         /*!< ADC on or off */
#define ADC_CTL1_DRES                       BITS(14,15)                                     /*!< ADC resolution */

/* ADC_SHCTL */
#define ADC_SHCTL_SHEN                      BITS(0,2)                                       /*!< channel-dedicated Sample-and-Hold circuit bypass select */
#define ADC_SHCTL_SH00EN                    BIT(0)                                          /*!< enable channel ADCx_IN0 sample-and-hold circuit */
#define ADC_SHCTL_SH01EN                    BIT(1)                                          /*!< enable channel ADCx_IN1 sample-and-hold circuit */
#define ADC_SHCTL_SH02EN                    BIT(2)                                          /*!< enable channel ADCx_IN2 sample-and-hold circuit */
#define ADC_SHCTL_SHMD                      BIT(16)                                         /*!< channel-dedicated sample-and-hold circuit operating mode */
#define ADC_SHCTL_SHEND                     BIT(17)                                         /*!< software end sample-and-hold circuit in constant sampling mode */
#define ADC_SHCTL_SHSTART                   BIT(18)                                         /*!< software start sample-and-hold circuit in constant sampling mode */
#define ADC_SHCTL_SHHTIME                   BITS(20,23)                                     /*!< the hold time of sample-and-hold circuit */
#define ADC_SHCTL_SHSTIME                   BITS(24,31)                                     /*!< the sample time of sample-and-hold circuit */

/* ADC_DMACTL */
#define ADC_DMACTL_GP1OVRIE                 BIT(3)                                          /*!< DMA overrun detect interrupt enable of Group_pri1 */
#define ADC_DMACTL_OVREN1                   BIT(4)                                          /*!< DMA overrun detect enable of Group_pri1 */
#define ADC_DMACTL_GP1OVRF                  BIT(5)                                          /*!< DMA overrun flag of Group_pri1 */
#define ADC_DMACTL_GP1DDM                   BIT(6)                                          /*!< DMA disable mode of Group_pri1 */
#define ADC_DMACTL_DMAEN1                   BIT(7)                                          /*!< DMA request enable of Group_pri1 */
#define ADC_DMACTL_GP2OVRIE                 BIT(11)                                         /*!< DMA overrun detect interrupt enable of Group_pri2 */
#define ADC_DMACTL_OVREN2                   BIT(12)                                         /*!< DMA overrun detect enable of Group_pri2 */
#define ADC_DMACTL_GP2OVRF                  BIT(13)                                         /*!< DMA overrun flag of Group_pri2 */
#define ADC_DMACTL_GP2DDM                   BIT(14)                                         /*!< DMA disable mode of Group_pri2 */
#define ADC_DMACTL_DMAEN2                   BIT(15)                                         /*!< DMA request enable of Group_pri2 */
#define ADC_DMACTL_GP3OVRIE                 BIT(19)                                         /*!< DMA overrun detect interrupt enable of Group_pri3 */
#define ADC_DMACTL_OVREN3                   BIT(20)                                         /*!< DMA overrun detect enable of Group_pri3 */
#define ADC_DMACTL_GP3OVRF                  BIT(21)                                         /*!< DMA overrun flag of Group_pri3 */
#define ADC_DMACTL_GP3DDM                   BIT(22)                                         /*!< DMA disable mode of Group_pri3 */
#define ADC_DMACTL_DMAEN3                   BIT(23)                                         /*!< DMA request enable of Group_pri3 */
#define ADC_DMACTL_GP4OVRIE                 BIT(27)                                         /*!< DMA overrun detect interrupt enable of Group_pri4 */
#define ADC_DMACTL_OVREN4                   BIT(28)                                         /*!< DMA overrun detect enable of Group_pri4 */
#define ADC_DMACTL_GP4OVRF                  BIT(29)                                         /*!< DMA overrun flag of Group_pri4 */
#define ADC_DMACTL_GP4DDM                   BIT(30)                                         /*!< DMA disable mode of Group_pri4 */
#define ADC_DMACTL_DMAEN4                   BIT(31)                                         /*!< DMA request enable of Group_pri4 */

/* ADC_BITRGCTL */
#define ADC_BITRGCTL_GP1BITGRS              BIT(1)                                          /*!< enable the next trigger restore of Group_pri1 */
#define ADC_BITRGCTL_GP1BIMEN               BIT(2)                                          /*!< enable bifurcate trigger mode of Group_pri1 */
#define ADC_BITRGCTL_GP1BICHSEL             BITS(3,7)                                       /*!< select bifurcate trigger channel of Group_pri1 */
#define ADC_BITRGCTL_GP2BITGRS              BIT(9)                                          /*!< enable the next trigger restore of Group_pri2 */
#define ADC_BITRGCTL_GP2BIMEN               BIT(10)                                         /*!< enable bifurcate trigger mode of Group_pri2 */
#define ADC_BITRGCTL_GP2BICHSEL             BITS(11,15)                                     /*!< select bifurcate trigger channel of Group_pri2 */
#define ADC_BITRGCTL_GP3BITGRS              BIT(17)                                         /*!< enable the next trigger restore of Group_pri3 */
#define ADC_BITRGCTL_GP3BIMEN               BIT(18)                                         /*!< enable bifurcate trigger mode of Group_pri3 */
#define ADC_BITRGCTL_GP3BICHSEL             BITS(19,23)                                     /*!< select bifurcate trigger channel of Group_pri3 */
#define ADC_BITRGCTL_GP4BITGRS              BIT(25)                                         /*!< enable the next trigger restore of Group_pri4 */
#define ADC_BITRGCTL_GP4BIMEN               BIT(26)                                         /*!< enable bifurcate trigger mode of Group_pri4 */
#define ADC_BITRGCTL_GP4BICHSEL             BITS(27,31)                                     /*!< select bifurcate trigger channel of Group_pri4 */

/* constants definitions */
/* ADC group select enumeration */
typedef enum {
    ADC_GROUP_PRI4 = 0,                                                                     /*!< select Group_pri4 */
    ADC_GROUP_PRI3,                                                                         /*!< select Group_pri3 */
    ADC_GROUP_PRI2,                                                                         /*!< select Group_pri2 */
    ADC_GROUP_PRI1,                                                                         /*!< select Group_pri1 */
} adc_group_select_enum;

/* ADC channel select enumeration */
typedef enum {
    ADC_CHANNEL_IN0 = 0,                                                                    /*!< select channel 0 (ADCx_IN0) */
    ADC_CHANNEL_IN1,                                                                        /*!< select channel 1 (ADCx_IN1) */
    ADC_CHANNEL_IN2,                                                                        /*!< select channel 2 (ADCx_IN2) */
    ADC_CHANNEL_IN3,                                                                        /*!< select channel 3 (ADCx_IN3) */
    ADC_CHANNEL_IN4,                                                                        /*!< select channel 4 (ADCx_IN4) */
    ADC_CHANNEL_IN5,                                                                        /*!< select channel 5 (ADCx_IN5) */
    ADC_CHANNEL_IN6,                                                                        /*!< select channel 6 (ADCx_IN6) */
    ADC_CHANNEL_IN7,                                                                        /*!< select channel 7 (ADCx_IN7), only for ADC2 */
    ADC_CHANNEL_IN8,                                                                        /*!< select channel 8 (ADCx_IN8), only for ADC2 */
    ADC_CHANNEL_IN9,                                                                        /*!< select channel 9 (ADCx_IN9), only for ADC2 */
    ADC_CHANNEL_TEMPERATURE,                                                                /*!< select temperature sensor channel, only for ADC2 */
    ADC_CHANNEL_VINT,                                                                       /*!< select internal reference voltage, only for ADC2 */
    ADC_CHANNEL_ALL,                                                                        /*!< select all channel */
} adc_channel_select_enum;

/* ADC bifurcate data select enumeration */
typedef enum {
    ADC_BIFURCATE_DATA = 0,                                                                 /*!< select Group_pri x bifurcate data register (ADC_GPxBIDATA) */
    ADC_EXTENDED_BIFURCATE_DATA_1,                                                          /*!< select Group_pri x bifurcate data register 1 (ADC_GPxBIDATA1) */
    ADC_EXTENDED_BIFURCATE_DATA_2,                                                          /*!< select Group_pri x bifurcate data register 2 (ADC_GPxBIDATA2) */
} adc_bifurcate_data_enum;

/* ADC disconnect detect mode enumeration */
typedef enum {
    ADC_DISCHARGE_MODE = 0,                                                                 /*!< select discharge mode  */
    ADC_PRECHARGE_MODE,                                                                     /*!< select precharge mode  */
    ADC_PRECHARGE_DISCHARGE_MODE_DISABLE,                                                   /*!< disable precharge and discharge mode */
} adc_disc_detect_mode_enum;

