burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_adc.h
/* ADC self-diagnosis mode enumeration */
typedef enum {
    ADC_SELF_DIAGNOSIS_MODE_ROTATION = 0,                                                   /*!< select rotation mode for self-diagnosis voltage */
    ADC_SELF_DIAGNOSIS_MODE_FIXED,                                                          /*!< select fixed mode for self-diagnosis voltage */
} adc_self_diag_mode_enum;

/* ADC self-diagnosis voltage select enumeration in fixed mode */
typedef enum {
    ADC_SELF_DIAG_0_V = 1,                                                                  /*!< uses the voltage of 0 V for self-diagnosis */
    ADC_SELF_DIAG_1_2_VREF,                                                                 /*!< uses the voltage of reference power supply VREFP/2 for self-diagnosis */
    ADC_SELF_DIAG_VREF,                                                                     /*!< uses the voltage of reference power supply VREFP for self-diagnosis */
} adc_self_diag_fixed_voltage_enum;

/* ADC restart channel select enumeration for Group_pri x */
typedef enum {
    ADC_RESTART_ON_BEGINNING = 0,                                                           /*!< rescan the lower priority group scanning from initial channel */
    ADC_RESTART_ON_BREAKING,                                                                /*!< rescan the lower priority group scanning from the last aborted channel */
} adc_restart_channel_enum;

/* analog watchdog select enumeration */
typedef enum {
    ADC_WATCHDOG_A = 0,                                                                     /*!< select analog watchdog A select */
    ADC_WATCHDOG_B,                                                                         /*!< select analog watchdog B select */
    ADC_WATCHDOG_A_B                                                                        /*!< select analog watchdog A and watchdog B */
} adc_watchdog_select_enum;

/* analog watchdog compare mode enumeration */
typedef enum {
    ADC_OUT_WINDOW = 0,                                                                     /*!< When the WINEN is 0,WDLT[15:0] value > A/D-converted value,When the WINEN is 1,A/D-converted value < WDLT[15:0] value or WDHT[15:0] < A/D-converted value */
    ADC_IN_WINDOW                                                                           /*!< When the WINEN is 0,WDLT[15:0] value < A/D-converted value,When the WINEN is 1,WDLT[15:0] value < A/D-converted value < WDHT[15:0] value */
} adc_watchdog_compare_condition_enum;

/* ADC oversample mode enumeration */
typedef enum {
    ADC_ACCUMULATION_MODE = 0,                                                              /*!< accumulation data mode */
    ADC_AVERAGE_MODE,                                                                       /*!< average data mode */
} adc_oversample_mode_enum;

/* interrupt select enumeration */
typedef enum {
    ADC_INT_EOC1RF = 0,                                                                     /*!< interrupt for EOC1RF */
    ADC_INT_EOC2RF,                                                                         /*!< interrupt for EOC2RF */
    ADC_INT_EOC3RF,                                                                         /*!< interrupt for EOC3RF */
    ADC_INT_EOC4RF,                                                                         /*!< interrupt for EOC4RF */
    ADC_INT_WDA_CHSTAT,                                                                     /*!< interrupt for watchdog A */
    ADC_INT_WDBEF,                                                                          /*!< interrupt for watchdog B */
    ADC_INT_GP1OVRF,                                                                        /*!< DMA overflow detect interrupt of Group_pri1 */
    ADC_INT_GP2OVRF,                                                                        /*!< DMA overflow detect interrupt of Group_pri2 */
    ADC_INT_GP3OVRF,                                                                        /*!< DMA overflow detect interrupt of Group_pri3 */
    ADC_INT_GP4OVRF                                                                         /*!< DMA overflow detect interrupt of Group_pri4 */
} adc_interrupt_enum;

/* interrupt flag select enumeration */
typedef enum {
    ADC_INT_FLAG_EOC1RF = 0,                                                                     /*!< interrupt for EOC1RF */
    ADC_INT_FLAG_EOC2RF,                                                                         /*!< interrupt for EOC2RF */
    ADC_INT_FLAG_EOC3RF,                                                                         /*!< interrupt for EOC3RF */
    ADC_INT_FLAG_EOC4RF,                                                                         /*!< interrupt for EOC4RF */
    ADC_INT_FLAG_WDA_CHSTAT,                                                                     /*!< interrupt for watchdog A */
    ADC_INT_FLAG_WDBEF,                                                                          /*!< interrupt for watchdog B */
    ADC_INT_FLAG_GP1OVRF,                                                                        /*!< DMA overflow detect interrupt of Group_pri1 */
    ADC_INT_FLAG_GP2OVRF,                                                                        /*!< DMA overflow detect interrupt of Group_pri2 */
    ADC_INT_FLAG_GP3OVRF,                                                                        /*!< DMA overflow detect interrupt of Group_pri3 */
    ADC_INT_FLAG_GP4OVRF                                                                         /*!< DMA overflow detect interrupt of Group_pri4 */
} adc_interrupt_flag_enum;

/* evevt select enumeration */
typedef enum {
    ADC_FLAG_EOC1F = 0,                                                                     /*!< end of Group_pri1 conversion flag */
    ADC_FLAG_EOC1RF,                                                                        /*!< end of Group_pri1 conversion round flag */
    ADC_FLAG_EOC2F,                                                                         /*!< end of Group_pri2 conversion flag */
    ADC_FLAG_EOC2RF,                                                                        /*!< end of Group_pri2 conversion round flag */
    ADC_FLAG_EOC3F,                                                                         /*!< end of Group_pri3 conversion flag */
    ADC_FLAG_EOC3RF,                                                                        /*!< end of Group_pri3 conversion round flag */
    ADC_FLAG_EOC4F,                                                                         /*!< end of Group_pri4 conversion flag */
    ADC_FLAG_EOC4RF,                                                                        /*!< end of Group_pri4 conversion round flag */
    ADC_FLAG_PROC,                                                                          /*!< A/D conversion process flag */
    ADC_FLAG_WDAMF,                                                                         /*!< analog watchdog A compare monitor flag */
    ADC_FLAG_WDBMF,                                                                         /*!< analog watchdog B compare monitor flag */
    ADC_FLAG_WDABMF,                                                                        /*!< analog watchdog A/B complex compare monitor flag */
    ADC_FLAG_GP1OVRF,                                                                       /*!< DMA overflow flag of Group_pri1 */
    ADC_FLAG_GP2OVRF,                                                                       /*!< DMA overflow flag of Group_pri2 */
    ADC_FLAG_GP3OVRF,                                                                       /*!< DMA overflow flag of Group_pri3 */
    ADC_FLAG_GP4OVRF,                                                                       /*!< DMA overflow flag of Group_pri4 */
    ADC_FLAG_WDBEF,                                                                         /*!< analog watchdog B event flag */
    ADC_FLAG_WDA_CH0CMPF,                                                                   /*!< channel ADCx_IN0 compare status in watchdog A */
    ADC_FLAG_WDA_CH1CMPF,                                                                   /*!< channel ADCx_IN1 compare status in watchdog A */
    ADC_FLAG_WDA_CH2CMPF,                                                                   /*!< channel ADCx_IN2 compare status in watchdog A */
    ADC_FLAG_WDA_CH3CMPF,                                                                   /*!< channel ADCx_IN3 compare status in watchdog A */
    ADC_FLAG_WDA_CH4CMPF,                                                                   /*!< channel ADCx_IN4 compare status in watchdog A */
    ADC_FLAG_WDA_CH5CMPF,                                                                   /*!< channel ADCx_IN5 compare status in watchdog A */
    ADC_FLAG_WDA_CH6CMPF,                                                                   /*!< channel ADCx_IN6 compare status in watchdog A */
    ADC_FLAG_WDA_CH7CMPF,                                                                   /*!< channel ADCx_IN7 compare status in watchdog A */
    ADC_FLAG_WDA_CH8CMPF,                                                                   /*!< channel ADCx_IN8 compare status in watchdog A */
    ADC_FLAG_WDA_CH9CMPF,                                                                   /*!< channel ADCx_IN9 compare status in watchdog A */
    ADC_FLAG_WDA_TEMPCMPF,                                                                  /*!< temperature sensor channel compare status in watchdog A */
    ADC_FLAG_WDA_VINTCMPF,                                                                  /*!< internal reference voltage channel compare status in watchdog A */
    ADC_FLAG_WDA_ALL_CHCMPF,                                                                /*!< all channel compare status in watchdog A */
} adc_event_flag_enum;

