burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_adc.h
/* ADC oversample mode enumeration */
typedef enum {
    ADC_EVIC_LINK_SOURCE_EOCRF_FLAG = 0,                                                    /*!< EVIC trigger signal selects EOCxRF */
    ADC_EVIC_LINK_SOURCE_EOCF_FLAG,                                                         /*!< EVIC trigger signal selects EOCxF */
} adc_evic_link_source_enum;

/* ADC data alignment */
#define ADC_DATAALIGN_RIGHT                     ((uint32_t)0x00000000U)                         /*!< LSB alignment */
#define ADC_DATAALIGN_LEFT                      ADC_CTL0_DAL                                    /*!< MSB alignment */

/* ADC resolution */
#define CTL1_DRES(regval)                       (BITS(14, 15) & ((uint32_t)(regval) << 14))     /*!< write value to ADC_CTL1_DRES bit field */
#define ADC_RESOLUTION_12B                      CTL1_DRES(0)                                    /*!< 12-bit ADC resolution */
#define ADC_RESOLUTION_10B                      CTL1_DRES(1)                                    /*!< 10-bit ADC resolution */
#define ADC_RESOLUTION_8B                       CTL1_DRES(2)                                    /*!< 8-bit ADC resolution */
#define ADC_RESOLUTION_6B                       CTL1_DRES(3)                                    /*!< 6-bit ADC resolution */

/* total addition conversion times */
#define ADC_OVERSAMPLING_RATIO_MUL_1            ((uint32_t)0x00000000U)                         /*!< 1-time conversion */
#define ADC_OVERSAMPLING_RATIO_MUL_2            ((uint32_t)0x00000001U)                         /*!< 2-time conversion */
#define ADC_OVERSAMPLING_RATIO_MUL_3            ((uint32_t)0x00000002U)                         /*!< 3-time conversion */
#define ADC_OVERSAMPLING_RATIO_MUL_4            ((uint32_t)0x00000003U)                         /*!< 4-time conversion */
#define ADC_OVERSAMPLING_RATIO_MUL_8            ((uint32_t)0x00000004U)                         /*!< 8-time conversion */
#define ADC_OVERSAMPLING_RATIO_MUL_16           ((uint32_t)0x00000005U)                         /*!< 16-time conversion */
#define ADC_OVERSAMPLING_RATIO_MUL_32           ((uint32_t)0x00000006U)                         /*!< 32-time conversion */
#define ADC_OVERSAMPLING_RATIO_MUL_64           ((uint32_t)0x00000007U)                         /*!< 64-time conversion */

/* Scan Mode Select */
#define CTL0_GSCAN(regval)                      (BITS(20, 21) & ((uint32_t)(regval) << 20))     /*!< write value to ADC_CTL0_GSCAN bit field */
#define ADC_GROUP_PRI1_SCAN_ONCE                CTL0_GSCAN(0)                                   /*!< select Group_pri1 scan once mode */
#define ADC_GROUPS_SCAN                         CTL0_GSCAN(1)                                   /*!< select groups scan mode */
#define ADC_GROUP_PRI1_SCAN_CONTINUE            CTL0_GSCAN(2)                                   /*!< select Group_pri1 scan continuous mode */

/* ADC to EVIC link signal select */
#define CTL0_EVICCTL(regval)                    (BITS(28, 30) & ((uint32_t)(regval) << 28))     /*!< EVIC link signal select */
#define ADC_EVIC_LINK_GROUP_PRI1                CTL0_EVICCTL(0)                                 /*!< an event signal is generated when scanning for Group_pri1 is completed */
#define ADC_EVIC_LINK_GROUP_PRI2                CTL0_EVICCTL(1)                                 /*!< an event signal is generated when scanning for Group_pri2 is completed */
#define ADC_EVIC_LINK_GROUP_PRI3                CTL0_EVICCTL(2)                                 /*!< an event signal is generated when scanning for Group_pri3 is completed */
#define ADC_EVIC_LINK_GROUP_PRI4                CTL0_EVICCTL(3)                                 /*!< an event signal is generated when scanning for Group_pri4 is completed */
#define ADC_EVIC_LINK_GROUP_ALL                 CTL0_EVICCTL(4)                                 /*!< an event signal is generated when scanning for all Group_pri is completed */

/* select the A/D conversion start synchronous trigger source for Group_prix (x=1,2,3,4) */
#define TRIGR_GP3TRGSRC(regval)                 (BITS(0, 5) & ((uint32_t)(regval) << 0))        /*!< write value to ADC_GPCFG_GPxTRGSRC bit field */
#define ADC_SYNCTRIG_SOURCE_TIMER0_TRGOF        TRIGR_GP3TRGSRC(1)                              /*!< select TIMER0_TRGOF for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_TIMER0_TRGUF        TRIGR_GP3TRGSRC(2)                              /*!< select TIMER0_TRGUF for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_TIMER0_TRGA         TRIGR_GP3TRGSRC(3)                              /*!< select TIMER0_TRGA for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_TIMER0_TRGB         TRIGR_GP3TRGSRC(4)                              /*!< select TIMER0_TRGB for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_TIMER0_TRGAB        TRIGR_GP3TRGSRC(5)                              /*!< select TIMER0_TRGAB for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_TIMER0_TRGAORB      TRIGR_GP3TRGSRC(6)                              /*!< select TIMER0_TRGA_OR_B for ADC extend bifurcate trigger source */
#define ADC_SYNCTRIG_SOURCE_TIMER0_TRGO         TRIGR_GP3TRGSRC(7)                              /*!< select TIMER0_TRGO for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_TIMER7_TRGOF        TRIGR_GP3TRGSRC(9)                              /*!< select TIMER7_TRGOF for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_TIMER7_TRGUF        TRIGR_GP3TRGSRC(10)                             /*!< select TIMER7_TRGUF for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_TIMER7_TRGA         TRIGR_GP3TRGSRC(11)                             /*!< select TIMER7_TRGA for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_TIMER7_TRGB         TRIGR_GP3TRGSRC(12)                             /*!< select TIMER7_TRGB for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_TIMER7_TRGAB        TRIGR_GP3TRGSRC(13)                             /*!< select TIMER7_TRGAB for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_TIMER7_TRGAORB      TRIGR_GP3TRGSRC(14)                             /*!< select TIMER7_TRGA_OR_B for ADC extend bifurcate trigger source */
#define ADC_SYNCTRIG_SOURCE_TIMER7_TRGO         TRIGR_GP3TRGSRC(15)                             /*!< select TIMER7_TRGO for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_TIMER1_TRGO         TRIGR_GP3TRGSRC(23)                             /*!< select TIMER1_TRGO for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_TIMER2_TRGO         TRIGR_GP3TRGSRC(31)                             /*!< select TIMER2_TRGO for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_GPTIMER0_TRGA       TRIGR_GP3TRGSRC(35)                             /*!< select GPTIMER0_TRGA for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_GPTIMER0_TRGB       TRIGR_GP3TRGSRC(36)                             /*!< select GPTIMER0_TRGB for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_GPTIMER0_TRGAB      TRIGR_GP3TRGSRC(37)                             /*!< select GPTIMER0_TRGAB for ADC extend bifurcate trigger source */
#define ADC_SYNCTRIG_SOURCE_GPTIMER1_TRGA       TRIGR_GP3TRGSRC(43)                             /*!< select GPTIMER1_TRGA for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_GPTIMER1_TRGB       TRIGR_GP3TRGSRC(44)                             /*!< select GPTIMER1_TRGB for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_GPTIMER1_TRGAB      TRIGR_GP3TRGSRC(45)                             /*!< select GPTIMER1_TRGAB for ADC extend bifurcate trigger source */
#define ADC_SYNCTRIG_SOURCE_EVIC_EVSEL0         TRIGR_GP3TRGSRC(49)                             /*!< select EVIC_EVSEL0 for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_EVIC_EVSEL1         TRIGR_GP3TRGSRC(50)                             /*!< select EVIC_EVSEL1 for ADC trigger source */
#define ADC_SYNCTRIG_SOURCE_EVIC_EVSEL0_OR_1    TRIGR_GP3TRGSRC(51)                             /*!< select EVIC_EVSEL0 or EVIC_EVSEL1 for ADC trigger source */

