burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_adc.h
/* trigger edge select of Group_pri x */
#define TRIGR_EXTEN_HIGH(regval)                (BITS(8, 9) & ((uint32_t)(regval) << 8))        /*!< write value to ADC_GPCFG_GP2TRGED bit field */
#define ADC_EXTERNAL_TRIG_RISING_EDGE           TRIGR_EXTEN_HIGH(1)                             /*!< Rising edge of external trigger enable */
#define ADC_EXTERNAL_TRIG_FAILING_EDGE          TRIGR_EXTEN_HIGH(2)                             /*!< Falling edge of external trigger enable */
#define ADC_EXTERNAL_TRIG_BOTH_EDGE             TRIGR_EXTEN_HIGH(3)                             /*!< Rising and falling edge of external trigger enable */

/* watchdog A/B complex conditions configuration */
#define CTRLR_CMPAB(regval)                     (BITS(6, 7) & ((uint32_t)(regval) << 6))        /*!< write value to ADC_WDCTL_WDABCC bit field */
#define ADC_WATCHDOG_MATCH_A_OR_B               CTRLR_CMPAB(0)                                  /*!< (watchdog A condition matched) OR (watchdog B condition matched) */
#define ADC_WATCHDOG_MATCH_A_XOR_B              CTRLR_CMPAB(1)                                  /*!< (watchdog A condition matched) XOR (watchdog B condition matched) */
#define ADC_WATCHDOG_MATCH_A_AND_B              CTRLR_CMPAB(2)                                  /*!< (watchdog A condition matched) AND (watchdog B condition matched) */

/* ADC SH channel select */
#define ADC_SH_CHANNEL_IN0                     ADC_SHCTL_SH00EN                                /*!< enable channel ADC0_IN0 sample-and-hold circuit */
#define ADC_SH_CHANNEL_IN1                     ADC_SHCTL_SH01EN                                /*!< enable channel ADC0_IN1 sample-and-hold circuit */
#define ADC_SH_CHANNEL_IN2                     ADC_SHCTL_SH02EN                                /*!< enable channel ADC0_IN2 sample-and-hold circuit */

/* function declarations */
/* A/D converter configuration functions */
/* reset ADC */
void adc_deinit(uint32_t adc_periph);
/* enable ADC interface */
void adc_enable(uint32_t adc_periph);
/* disable ADC interface */
void adc_disable(uint32_t adc_periph);
/* configure ADC data alignment */
void adc_data_alignment_config(uint32_t adc_periph, uint32_t data_alignment);
/* configure ADC resolution */
void adc_resolution_config(uint32_t adc_periph, uint32_t resolution);

/* ADC self-diagnosis functions */
/* enable self-diagnosis */
void adc_self_diagnosis_enable(uint32_t adc_periph);
/* disable self-diagnosis */
void adc_self_diagnosis_disable(uint32_t adc_periph);
/* config self-diagnosis */
void adc_self_diagnosis_mode_config(uint32_t adc_periph, adc_self_diag_mode_enum mode, adc_self_diag_fixed_voltage_enum voltage_select);

/* ADC disconnection detection functions */
/* configure disconnection detection assist mode */
void adc_disconnect_detect_mode_config(uint32_t adc_periph, adc_disc_detect_mode_enum mode);
/* configure disconnect detect period */
void adc_disconnect_detect_period_config(uint32_t adc_periph, uint32_t period);

/* ADC data registers automatic clear or set functions */
/* enable automatic clearing data registers */
void adc_data_auto_clear_enable(uint32_t adc_periph);
/* disable automatic clearing data registers */
void adc_data_auto_clear_disable(uint32_t adc_periph);
/* enable automatic setting data registers */
void adc_data_auto_set_enable(uint32_t adc_periph);
/* disable automatic setting data registers */
void adc_data_auto_set_disable(uint32_t adc_periph);

/* ADC sample and hold functions */
/* configure ADC sample-and-hold channel */
void adc_sample_hold_channel_config(uint32_t channel, ControlStatus ctl);
/* configure ADC sample time for sample-and-hold circuits */
void adc_sh_sample_time_config(uint8_t sample_time);
/* configure ADC hold time for sample-and-hold circuits */
void adc_sh_hold_time_config(uint8_t hold_time);
/* enable ADC constant sampling mode for sample-and-hold circuits */
void adc_sh_constant_sampling_mode_enable(void);
/* disable ADC constant sampling mode for sample-and-hold circuits */
void adc_sh_constant_sampling_mode_disable(void);
/* software start sample-and-hold circuit in constant sampling mode */
void adc_sh_constant_sampling_start(void);
/* software end sample-and-hold circuit in constant sampling mode */
void adc_sh_constant_sampling_stop(void);

/* ADC analog watchdog functions */
/* enable ADC analog watchdog */
void adc_watchdog_enable(uint32_t adc_periph, adc_watchdog_select_enum window);
/* disable ADC analog watchdog */
void adc_watchdog_disable(uint32_t adc_periph, adc_watchdog_select_enum window);
/* configure ADC analog watchdog A channel */
void adc_watchdog_a_channel_config(uint32_t adc_periph, adc_channel_select_enum channel, adc_watchdog_compare_condition_enum compare_mode);
/* deselect ADC analog watchdog A channel */
void adc_watchdog_a_channel_deselect(uint32_t adc_periph, adc_channel_select_enum channel);
/* configure ADC analog watchdog B channel */
void adc_watchdog_b_channel_config(uint32_t adc_periph, adc_channel_select_enum channel, adc_watchdog_compare_condition_enum compare_mode);
/* configure ADC analog watchdog A threshold */
void adc_watchdog_a_threshold_config(uint32_t adc_periph, uint16_t low_threshold, uint16_t high_threshold);
/* configure ADC analog watchdog B threshold */
void adc_watchdog_b_threshold_config(uint32_t adc_periph, uint16_t low_threshold, uint16_t high_threshold);
/* enable ADC analog watchdog window function */
void adc_watchdog_window_mode_enable(uint32_t adc_periph);
/* disable ADC analog watchdog window function */
void adc_watchdog_window_mode_disable(uint32_t adc_periph);
/* configure ADC analog watchdog complex conditions */
void adc_watchdog_complex_condition_config(uint32_t adc_periph, uint32_t mode);

/* ADC oversample functions */
/* configure ADC oversample channel */
void adc_oversample_channel_config(uint32_t adc_periph, adc_channel_select_enum channel, uint32_t ratio);
/* configure ADC oversample mode */
void adc_oversample_mode_config(uint32_t adc_periph, adc_oversample_mode_enum mode);
/* enable ADC oversample mode */
void adc_oversample_mode_enable(uint32_t adc_periph);
/* disable ADC oversample mode */
void adc_oversample_mode_disable(uint32_t adc_periph);

/* ADC group scan configure functions */
/* configure the ADC scan mode */
void adc_group_scan_mode_config(uint32_t adc_periph, uint32_t scan_mode);
/* enable group priority control */
void adc_group_priority_control_enable(uint32_t adc_periph);
/* disable group priority control */
void adc_group_priority_control_disable(uint32_t adc_periph);
/* enable A/D conversion operation for Group_pri3 */
void adc_group_pri3_enable(uint32_t adc_periph);
/* disable A/D conversion operation for Group_pri3 */
void adc_group_pri3_disable(uint32_t adc_periph);
/* enable A/D conversion operation for Group_pri4 */
void adc_group_pri4_enable(uint32_t adc_periph);
/* disable A/D conversion operation for Group_pri4 */
void adc_group_pri4_disable(uint32_t adc_periph);
/* enable lowest-priority group scan continuous */
void adc_group_lowest_priority_continuous_enable(uint32_t adc_periph);
/* disable lowest-priority group scan continuous */
void adc_group_lowest_priority_continuous_disable(uint32_t adc_periph);
/* enable low-priority group restart */
void adc_group_restart_enable(uint32_t adc_periph, adc_group_select_enum group, adc_restart_channel_enum restart_ch);
/* disable low-priority group restart */
void adc_group_restart_disable(uint32_t adc_periph, adc_group_select_enum group);
/* select ADC channel for Group_pri x */
void adc_group_channel_config(uint32_t adc_periph, adc_group_select_enum group, adc_channel_select_enum channel, uint32_t sample_time);
/* deselecte ADC group channel */
void adc_group_channel_deselect(uint32_t adc_periph, adc_group_select_enum group, adc_channel_select_enum channel);
/* config end of Group_prix conversion round counts flag */
void adc_group_end_flag_round_config(uint32_t adc_periph, adc_group_select_enum group, uint8_t num);
/* enable ADC external trigger */
void adc_group_external_trigger_enable(uint32_t adc_periph, adc_group_select_enum group);
/* config ADC external trigger edge */
void adc_group_extern_trigger_edge_config(uint32_t adc_periph, adc_group_select_enum group, uint32_t edge_sel);
/* disable ADC external trigger */
void adc_group_external_trigger_disable(uint32_t adc_periph, adc_group_select_enum group);
/* enable ADC synchronous trigger */
void adc_group_synchronous_trigger_enable(uint32_t adc_periph, adc_group_select_enum group);
/* configure ADC external trigger source */
void adc_group_synchronous_trigger_source_config(uint32_t adc_periph, adc_group_select_enum group, uint32_t external_trigger_source);
/* enable ADC asynchronous trigger */
void adc_group_asynchronous_trigger_enable(uint32_t adc_periph, adc_group_select_enum group);
/* enable ADC software trigger */
void adc_group_software_trigger_enable(uint32_t adc_periph, adc_group_select_enum group);
/* software end conversion of all groups */
void adc_group_software_end_conversion(uint32_t adc_periph);

