burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_adc.h
/* ADC group bifurcate configure functions */
/* enable ADC bifurcate trigger mode for Group_pri x */
void adc_group_bifurcate_mode_enable(uint32_t adc_periph, adc_group_select_enum group);
/* disable ADC bifurcate trigger mode for Group_pri x */
void adc_group_bifurcate_mode_disable(uint32_t adc_periph, adc_group_select_enum group);
/* ADC bifurcate trigger channel select */
void adc_group_bifurcate_channel_select(uint32_t adc_periph, adc_group_select_enum group, adc_channel_select_enum channel);
/* extend bifurcate trigger source select */
void adc_group_bifurcate_extend_trigger_select(uint32_t adc_periph, adc_group_select_enum group, uint32_t trigger_source);
/* enable restore of the next trigger during the current A/D conversion round */
void adc_group_bifurcate_trigger_restart_enable(uint32_t adc_periph, adc_group_select_enum group);
/* disable restore of the next trigger during the current A/D conversion round */
void adc_group_bifurcate_trigger_restart_disable(uint32_t adc_periph, adc_group_select_enum group);

/* ADC group DMA configure functions */
/* enable DMA request */
void adc_group_dma_mode_enable(uint32_t adc_periph, adc_group_select_enum group);
/* disable DMA request */
void adc_group_dma_mode_disable(uint32_t adc_periph, adc_group_select_enum group);
/* when DMA=1, the DMA engine issues a request at end of each scan conversion */
void adc_group_dma_request_after_last_enable(uint32_t adc_periph, adc_group_select_enum group);
/* the DMA engine is disabled after the end of transfer signal from DMA controller is detected */
void adc_group_dma_request_after_last_disable(uint32_t adc_periph, adc_group_select_enum group);
/* enable dma overrun detect */
void adc_group_dma_overrun_detect_enable(uint32_t adc_periph, adc_group_select_enum group);
/* disable dma overrun detect */
void adc_group_dma_overrun_detect_disable(uint32_t adc_periph, adc_group_select_enum group);

/* ADC channel configure functions */
/* channel priority config */
void adc_channel_priority_config(uint32_t adc_periph, uint8_t rank, adc_channel_select_enum adc_channel);
/* configure ADC sample time */
void adc_channel_sample_time_config(uint32_t adc_periph, adc_channel_select_enum channel, uint32_t sample_time);

/* ADC to EVIC trigger functions */
/* select which event as the EVIC link signal */
void adc_evic_link_signal_event_config(uint32_t adc_periph, uint32_t linksignal);
/* select EVIC link signal source for Gruop_pri x */
void adc_group_evic_link_signal_source(uint32_t adc_periph, adc_group_select_enum group, adc_evic_link_source_enum signal_src);

/* ADC data read functions */
/* read ADC channel data register */
uint16_t adc_channel_data_read(uint32_t adc_periph, adc_channel_select_enum channel);
/* read ADC self-diagnosis data */
uint16_t adc_self_diagnosis_data_read(uint32_t adc_periph);
/* read ADC self-diagnosis status */
uint16_t adc_self_diagnosis_status_read(uint32_t adc_periph);
/* read ADC bifurcate data register */
uint16_t adc_bifurcate_data_read(uint32_t adc_periph, adc_group_select_enum group, adc_bifurcate_data_enum channel);

/* flag and interrupt functions */
/* get the ADC flag */
FlagStatus adc_flag_get(uint32_t adc_periph, adc_event_flag_enum flag);
/* clear the ADC flag */
void adc_flag_clear(uint32_t adc_periph, adc_event_flag_enum flag);
/* enable ADC interrupt */
void adc_interrupt_enable(uint32_t adc_periph, adc_interrupt_enum interrupt);
/* disable ADC interrupt */
void adc_interrupt_disable(uint32_t adc_periph, adc_interrupt_enum interrupt);
/* get the ADC interrupt */
FlagStatus adc_interrupt_flag_get(uint32_t adc_periph, adc_interrupt_flag_enum int_flag);
/* clear the ADC flag */
void adc_interrupt_flag_clear(uint32_t adc_periph, adc_interrupt_flag_enum int_flag);

#endif /* GD32M53X_ADC_H */
